Revit 2024 API
Material.Smoothness Property
 The smoothness of the material.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public int Smoothness { get; set; }
Visual Basic
Public Property Smoothness As Integer
	Get
	Set
Visual C++
public:
property int Smoothness {
	int get ();
	void set (int value);
}
Field Value
 The value ranges from 0 to 100.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: values for shininess must be between 0 and 128
See Also
Material Class
Autodesk.Revit.DB Namespace